namespace Application.Plugin.Script
{
    internal partial class NpcScript
    {

        // Npc: 1012005
        public async Task petmaster()
        {
            await SayNext("嗯...你是不是偶然间在抚养我的孩子？我完善了一个使用生命之水给玩偶注入生命的咒语。人们称之为#b宠物#k。如果你身边有一个，随时可以问我问题。");

            var selection = await AskMenu("你想了解更多什么？#b\r\n#L0#告诉我更多关于宠物的信息。#l\r\n#L1#我如何养宠物？#l\r\n#L2#宠物也会死吗？#l\r\n#L3#布朗和黑色小猫的指令是什么？#l\r\n#L4#棕色小狗的指令是什么？#l\r\n#L5#粉红和白色兔子的指令是什么？#l\r\n#L6#小魔龙的指令是什么？#l\r\n#L7#圣诞麋鹿的指令是什么？#l\r\n#L8#黑色猪的指令是什么？#l\r\n#L9#熊猫的指令是什么？#l\r\n#L10#哈士奇的指令是什么？#l\r\n#L11#迪诺龙、妮诺龙的指令是什么？#l\r\n#L12#猴子的指令是什么？#l\r\n#L13#火鸡的指令是什么？#l\r\n#L14#白虎的指令是什么？#l\r\n#L15#企鹅的指令是什么？#l\r\n#L16#金猪的指令是什么？#l\r\n#L17#机器人的指令是什么？#l\r\n#L18#迷你雪吉拉的指令是什么？#l\r\n#L19#巴洛谷的指令是什么？#l\r\n#L20#宝宝龙的指令是什么？#l\r\n#L21#绿色/红色/蓝色龙的指令是什么？#l\r\n#L22#黑龙的指令是什么？#l\r\n#L23#黑色鬼精灵的指令是什么？#l\r\n#L24#豪猪的指令是什么？#l\r\n#L25#雪人的指令是什么？#l\r\n#L26#臭鼬的指令是什么？#l\r\n#L27#请教我如何转移宠物能力点。#l");

            switch (selection)
            {
                case 0:
                    await SayNext("所以你想了解更多关于宠物的事情。很久以前，我制作了一个玩偶，喷洒了生命之水，并对它施了咒语，创造出了一个神奇的动物。我知道这听起来不可思议，但它是一个变成了真实生物的玩偶。它们非常理解并且能很好地跟随人类。");
                    await SaySpeech([
                        "但是生命之水只在世界树的最底部出现一点点，所以我不能给它太多生命时间……我知道，这很不幸……但即使它再次变成玩偶，我总是可以把生命注入它，所以在你和它在一起的时候要对它好。",
                        "哦，是的，当你给它们特殊指令时，它们会做出反应。你可以责备它们，爱护它们……这都取决于你如何照顾它们。它们害怕离开主人，所以要对它们好，向它们展示爱。它们会很快感到伤心和孤独……"
                    ]);
                    break;
                case 1:
                    await SayNext("根据您给出的指令，宠物可能会喜欢、讨厌，并对其显示其他种类的反应。如果您给宠物一个指令，它能很好地跟随您，您的亲密度会提高。双击宠物，您可以检查亲密度、等级、饱食度等等...");
                    await SaySpeech([
                        "和宠物交谈，关注它，它的亲密度将提高，最终它的整体等级也会提高。随着亲密度的提高，宠物的整体等级也会很快提高。随着整体等级的提高，有一天宠物甚至可能会稍微像人一样说话，所以努力提升它。当然，这并不容易……",
                        "它可能是一个活的玩偶，但它们也有生命，所以它们也会感到饥饿。#b饱食度#k 显示宠物的饥饿水平。100 是最高值，数值越低，宠物就越饥饿。一段时间后，它甚至不会听从你的命令，而会主动进攻，所以要小心。"
                    ]);
                    break;
                case 2:
                    await SayNext("垂死……嗯，严格来说它们并不算是活着的，所以我不知道是否用\"垂死\"这个词合适。它们是用我的魔法力量和生命之水变成活物的娃娃。当然，它们活着的时候，就像活生生的动物一样……");
                    await SaySpeech([
                        "一段时间后……没错，它们停止了移动。魔法效果消失，生命之水干涸后，它们就会变回木偶。但这并不意味着它们永远停止了，因为一旦你倒上生命之水，它们就会重新活过来。",
                        "即使它有一天再次移动，看到它们完全停止还是很伤心的。请在它们还活着并移动时对它们好一点。也要好好喂养它们。知道有一些活着的东西只跟随并听从你，是不是很好呢？"
                    ]);
                    break;
                case 3:
                    await SayNext("这些是#r棕色小猫和黑色小猫#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏猫, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 10 ~ 30)\r\n#b可爱#k (等级 10 ~ 30)\r\n#b站起来, 站立, 起来#k (等级 20 ~ 30)");
                    break;
                case 4:
                    await SayNext("这些是#r棕色小狗#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏狗, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 坏狗, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b撒尿#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 10 ~ 30)\r\n#b趴下#k (等级 10 ~ 30)\r\n#b站起来, 站, 起立#k (等级 20 ~ 30)");
                    break;
                case 5:
                    await SayNext("这些是#r粉红兔子和白兔子#k的指令。指令旁边提到的等级是宠物需要的等级才能响应。\r\n#b坐#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b站起来, 站立, 起立#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 10 ~ 30)\r\n#b拥抱#k (等级 10 ~ 30)\r\n#b睡觉, 困, 上床#k (等级 20 ~ 30)");
                    break;
                case 6:
                    await SayNext("这些是#r小魔龙#k的指令。指令旁边提到的等级是宠物需要的等级才能响应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bbad, no, badgirl, badboy#k (等级 1 ~ 30)\r\n#bup, stand, rise#k (等级 1 ~ 30)\r\n#biloveyou#k (等级 1~30)\r\n#bpee#k (等级 1 ~ 30)\r\n#btalk, say, chat#k (等级 10 ~ 30)\r\n#bthelook, charisma#k (等级 10 ~ 30)\r\n#bdown#k (等级 10 ~ 30)\r\n#bgoodboy, goodgirl#k (等级 20 ~ 30)");
                    break;
                case 7:
                    await SayNext("这些是#r圣诞麋鹿#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bbad, no, badgirl, badboy#k (等级 1 ~ 30)\r\n#bup, stand#k (等级 1 ~ 30)\r\n#bstupid, ihateyou, dummy#k (等级 1 ~ 30)\r\n#bmerryxmas, merrychristmas#k (等级 1 ~ 30)\r\n#biloveyou#k (等级 1~30)\r\n#bpoop#k (等级 1 ~ 30)\r\n#btalk, say, chat#k (等级 11 ~ 30)\r\n#blonely, alone#k (等级 11 ~ 30)\r\n#bcutie#k (等级 11 ~ 30)\r\n#bmush, go#k (等级 21 ~ 30)");
                    break;
                case 8:
                    await SayNext("这些是#r黑猪#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏猪, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b握手#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b微笑#k (等级 10 ~ 30)\r\n#b魅力, 魅力#k (等级 20 ~ 30)");
                    break;
                case 9:
                    await SayNext("这些是#r熊猫#k的指令。指令旁边提到的等级是宠物需要达到的等级才能响应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b放松, 休息#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏孩子, 坏孩子#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b站起来, 站立, 起立#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b让我们玩#k (等级 10 ~ 30)\r\n#b嗯, 呃#k (等级 10 ~ 30)\r\n#b睡觉#k (等级 20 ~ 30)");
                    break;
                case 10:
                    await SayNext("这些是#r哈士奇#k的指令。指令旁边提到的等级是宠物需要达到的等级才能响应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bbad, no, badgirl, badboy#k (等级 1 ~ 30)\r\n#bstupid, ihateyou, baddog, dummy#k (等级 1 ~ 30)\r\n#bhand#k (等级 1 ~ 30)\r\n#bpoop#k (等级 1 ~ 30)\r\n#biloveyou#k (等级 1 ~ 30)\r\n#bdown#k (等级 10 ~ 30)\r\n#btalk, chat, say#k (等级 10 ~ 30)\r\n#bup, stand, rise#k (等级 20 ~ 30)");
                    break;
                case 11:
                    await SayNext("这些是#r迪诺龙和妮诺龙#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏男孩, 坏女孩#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b微笑, 笑#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b可爱#k (等级 10 ~ 30)\r\n#b睡觉, 小睡, 困#k (等级 20 ~ 30)");
                    break;
                case 12:
                    await SayNext("这些是#r猴子#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b休息#k (等级 1 ~ 30)\r\n#b坏孩子, 不乖#k (等级 1 ~ 30)\r\n#b撒尿#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b站起来#k (等级 1 ~ 30)\r\n#b说话, 聊天#k (等级 10 ~ 30)\r\n#b玩耍#k (等级 10 ~ 30)\r\n#b我想你#k (等级 10 ~ 30)\r\n#b睡觉, 上床睡觉, 困了#k (等级 20 ~ 30)");
                    break;
                case 13:
                    await SayNext("这些是#r火鸡#k的指令。指令旁边提到的等级是宠物需要达到的等级才能响应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bno, rudeboy, mischief#k (等级 1 ~ 30)\r\n#bstupid#k (等级 1 ~ 30)\r\n#biloveyou#k (等级 1 ~ 30)\r\n#bup, stand#k (等级 1 ~ 30)\r\n#btalk, chat, gobble#k (等级 10 ~ 30)\r\n#byes, goodboy#k (等级 10 ~ 30)\r\n#bsleepy, birdnap, doze#k (等级 20 ~ 30)\r\n#bbirdeye, thanksgiving, fly, friedbird, imhungry#k (等级 30)");
                    break;
                case 14:
                    await SayNext("这些是#r白虎#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏男孩, 坏女孩#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b休息, 放松#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b悲伤, 伤心#k (等级 10 ~ 30)\r\n#b等待#k (等级 20 ~ 30)");
                    break;
                case 15:
                    await SayNext("这些是 #r企鹅#k 的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#b坐#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏孩子, 坏女孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b站起来, 站, 起来#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b拥抱, 抱抱我#k (等级 10 ~ 30)\r\n#b挥动, 举手#k (等级 10 ~ 30)\r\n#b睡觉#k (等级 20 ~ 30)\r\n#b亲吻, 亲亲, 亲一个#k (等级 20 ~ 30)\r\n#b飞#k (等级 20 ~ 30)\r\n#b可爱, 可爱的#k (等级 20 ~ 30)");
                    break;
                case 16:
                    await SayNext("这些是 #r金猪#k 的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏蛋, 坏女孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 11 ~ 30)\r\n#b爱我, 拥抱我#k (等级 11 ~ 30)\r\n#b睡觉, 困了, 去睡觉#k (等级 21 ~ 30)\r\n#b无视 / 印象深刻 / 离开#k (等级 21 ~ 30)\r\n#b翻滚, 给我钱#k (等级 21 ~ 30)");
                    break;
                case 17:
                    await SayNext("这些是#r机器人#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b站起来, 站立, 起立#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b坏, 不, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b攻击, 冲锋#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b好, 魅力, 魅力#k (等级 11 ~ 30)\r\n#b说话, 聊天, 聊天, 说#k (等级 11 ~ 30)\r\n#b变装, 变化, 变形#k (等级 11 ~ 30)");
                    break;
                case 18:
                    await SayNext("这些是#r迷你雪吉拉#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不乖, 坏男孩, 坏女孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b跳舞, 舞动, 摇摆#k (等级 1 ~ 30)\r\n#b可爱, 可爱宝贝, 漂亮, 可爱的#k (等级 1 ~ 30)\r\n#b我爱你, 喜欢你, 我的爱#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 11 ~ 30)\r\n#b睡觉, 小睡, 困了, 去睡觉#k (等级 11 ~ 30)");
                    break;
                case 19:
                    await SayNext("这些是#r巴洛谷#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#bliedown#k (等级 1 ~ 30)\r\n#bno|bad|badgirl|badboy#k (等级 1 ~ 30)\r\n#biloveyou|mylove|likeyou#k (等级 1 ~ 30)\r\n#bcute|cutie|pretty|adorable#k (等级 1 ~ 30)\r\n#bpoop#k (等级 1 ~ 30)\r\n#bsmirk|crooked|laugh#k (等级 1 ~ 30)\r\n#bmelong#k (等级 11 ~ 30)\r\n#bgood|thelook|charisma#k (等级 11 ~ 30)\r\n#bspeak|talk|chat|say#k (等级 11 ~ 30)\r\n#bsleep|nap|sleepy#k (等级 11 ~ 30)\r\n#bgas#k (等级 21 ~ 30)");
                    break;
                case 20:
                    await SayNext("这些是#r宝宝龙#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b不行|坏|坏女孩|坏男孩#k (等级 1 ~ 30)\r\n#b我爱你|爱你#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b笨蛋|讨厌你|傻瓜#k (等级 1 ~ 30)\r\n#b可爱#k (等级 11 ~ 30)\r\n#b说话|聊天|说#k (等级 11 ~ 30)\r\n#b睡觉|困|上床#k (等级 11 ~ 30)");
                    break;
                case 21:
                    await SayNext("这些是#r绿/红/蓝龙#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐#k (等级 15 ~ 30)\r\n#b不|坏|坏女孩|坏男孩#k (等级 15 ~ 30)\r\n#b我爱你|爱你#k (等级 15 ~ 30)\r\n#b便便#k (等级 15 ~ 30)\r\n#b笨蛋|讨厌你|傻瓜#k (等级 15 ~ 30)\r\n#b说|聊天|说话#k (等级 15 ~ 30)\r\n#b睡觉|困|上床#k (等级 15 ~ 30)\r\n#b变身#k (等级 21 ~ 30)");
                    break;
                case 22:
                    await SayNext("这些是#r黑龙#k的指令。指令旁边提到的等级是宠物需要达到的等级才能响应。\r\n#b坐下#k (等级 15 ~ 30)\r\n#b不行|坏|坏女孩|坏男孩#k (等级 15 ~ 30)\r\n#b我爱你|爱你#k (等级 15 ~ 30)\r\n#b拉屎#k (等级 15 ~ 30)\r\n#b笨蛋|讨厌你|傻瓜#k (等级 15 ~ 30)\r\n#b说话|聊天|说#k (等级 15 ~ 30)\r\n#b睡觉|困|上床#k (等级 15 ~ 30)\r\n#b可爱, 变化#k (等级 21 ~ 30)");
                    break;
                case 23:
                    await SayNext("这些是#r黑色鬼精灵#k的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#bsit#k (等级 1 ~ 30)\r\n#bno|bad|badgirl|badboy#k (等级 1 ~ 30)\r\n#bplaydead, poop#k (等级 1 ~ 30)\r\n#btalk|chat|say#k (等级 1 ~ 30)\r\n#biloveyou, hug#k (等级 1 ~ 30)\r\n#bsmellmyfeet, rockout, boo#k (等级 1 ~ 30)\r\n#btrickortreat#k (等级 1 ~ 30)\r\n#bmonstermash#k (等级 1 ~ 30)");
                    break;
                case 24:
                    await SayNext("这些是#r豪猪#k的指令。指令旁边提到的等级显示了宠物需要的等级才能执行该指令。\r\n#bsit#k (等级 1 ~ 30)\r\n#bno|bad|badgirl|badboy#k (等级 1 ~ 30)\r\n#biloveyou|hug|goodboy#k (等级 1 ~ 30)\r\n#btalk|chat|say#k (等级 1 ~ 30)\r\n#bcushion|sleep|knit|poop#k (等级 1 ~ 30)\r\n#bcomb|beach#k (等级 10 ~ 30)\r\n#btreeninja#k (等级 20 ~ 30)\r\n#bdart#k (等级 20 ~ 30)");
                    break;
                case 25:
                    await SayNext("这些是 #r雪人#k 的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你, 我的爱, 我喜欢你#k (等级 1 ~ 30)\r\n#b圣诞快乐#k (等级 1 ~ 30)\r\n#b可爱, 可爱, 可爱, 漂亮#k (等级 1 ~ 30)\r\n#b梳理, 海滩/坏, 不, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说/睡觉, 困了, 去睡觉#k (等级 10 ~ 30)\r\n#b变化#k (等级 20 ~ 30)");
                    break;
                case 26:
                    await SayNext("这些是#r臭鼬#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bbad/no/badgirl/badboy#k (等级 1 ~ 30)\r\n#brestandrelax, poop#k (等级 1 ~ 30)\r\n#btalk/chat/say, iloveyou#k (等级 1 ~ 30)\r\n#bsnuggle/hug, sleep, goodboy#k (等级 1 ~ 30)\r\n#bfatty, blind, badbreath#k (等级 10 ~ 30)\r\n#bsuitup, bringthefunk#k (等级 20 ~ 30)");
                    break;
                case 27:
                    await SayNext("为了转移宠物的能力点、亲密度和等级，需要使用宠物能力点重置卷轴。如果你把这个卷轴带到艾琳尼亚的仙女玛尔那里，她会把宠物的等级和亲密度转移到另一个宠物身上。我特别给你这个是因为我能感受到你对宠物的情感。不过，我不能白白地把它给你。我可以以25万金币的价格把这本书卖给你。哦，我差点忘了！即使你有了这本书，如果没有新的宠物来转移能力点的话，它也没用。");
                    if (await AskYesNo("25万金币将被扣除。你真的想购买吗？"))
                    {
                        if (getMeso() < 250000 || !canHold(4160011))
                        {
                            await SayOK("请检查您的背包是否有空位，或者您是否没有足够的金币。");
                        }
                        else
                        {
                            gainMeso(-250000);
                            gainItem(4160011, 1);
                        }
                    }
                    break;
            }
        }


        // Npc: 1012006
        public async Task pet_lifeitem()
        {
            var selection = await AskMenu("你有什么事情找我吗？\r\n#L0##b请告诉我关于这个地方的情况。#l\r\n#L1#我是因为仙子玛尔的话才来这里的…#k#l");

            if (selection == 0)
            {
                if (haveItem(4031035))
                {
                    await SayNext("拿到那封信，和你的宠物一起跳过障碍物，把那封信带给我的兄弟弗罗德训练师。把信交给他，你的宠物会有好事发生。");
                }
                else if (await AskYesNo("这是你可以带宠物散步的路。你可以和它一起四处走动，或者训练它通过这里的障碍。如果你和宠物还不够亲近，可能会出现问题，它就不会像你想的那样听从你的命令。那么，你觉得呢？想要训练你的宠物吗？"))
                {
                    gainItem(4031035, 1);
                    await SayNext("好的，这是信。如果你直接去那里，他不会知道我派你去的，所以带着你的宠物通过障碍，到达顶部，然后和弗罗德训练师交谈，把信交给他。如果你在通过障碍时注意你的宠物，这并不难。祝你好运！");
                }
                else
                {
                    await SayNext("嗯...现在太忙了？如果你想做的话，回来找我吧。");
                }
            }
            else
            {
                await SayOK("嘿，你确定你见过#b仙灵玛尔#k吗？如果你以前从未见过她，不要对我撒谎，因为很明显。那甚至不是一个好谎言！");
            }
        }


        // Npc: 1012007
        public async Task pet_letter()
        {
            if (haveItem(4031035))
            {
                await SayNext("嗯，那是我哥的信！可能是在责备我觉得自己没在工作之类的事情...嗯？啊...你听从我哥的建议，训练了你的宠物并且到了这里，是吧？太棒了！既然你为了到这里努力了，我会提高你和宠物的亲密度等级。");
                if (getPlayer().getNoPets() == 0)
                {
                    await SayOK("嗯... 你真的带着你的宠物来到这里吗？这些障碍是为宠物准备的。你没有宠物来这里干什么？滚出去！");
                }
                else
                {
                    gainItem(4031035, -1);
                    gainTameness(2);
                    await SayOK("你觉得呢？你不觉得你和你的宠物已经更亲近了吗？如果你有时间，再次训练你的宠物通过这个障碍课程……当然，要得到我哥哥的许可。");
                }
            }
            else
            {
                await SayOK("我哥叫我照顾宠物障碍赛道，但是……因为我离他太远了，我忍不住想要四处闲逛……嘿嘿，既然看不见他，那就随便放松几分钟吧。");
            }
        }

        // Npc: 1032102
        public async Task pet_life()
        {
            if (await AskYesNo("我是仙女玛尔。如果你有一只等级达到15级或更高的龙和一块进化之石，我可以帮你进化你的龙。如果你幸运的话，甚至可能会得到一只黑色的龙！你想让我这样做吗？"))
            {
                if (haveItem(5000028, 1))
                {
                    gainItem(5000028, -1);
                    gainItem(5000029, 1);
                    await SayOK("我不知道你是怎么得到那个蛋的，但显然它已经孵化了！");
                }
                else if (getPlayer().getPet(0) == null)
                {
                    await SayOK("确保你的宠物装备在第一个槽位上。");
                }
                else if (getPlayer().getPet(0).getItemId() < 5000029 || getPlayer().getPet(0).getItemId() > 5000033 || !haveItem(5380000, 1))
                {
                    await SayOK("你不符合要求。你需要 #i5380000##t5380000#，以及 #d#i5000029##t5000029##k, #g#i5000030##t5000030##k, #r#i5000031##t5000031##k, #b#i5000032##t5000032##k, 或者 #e#i5000033##t5000033##n 中的任意一个装备在槽位1上。请在符合条件后再来。");
                }
                else if (getPlayer().getPet(0).getLevel() < 15)
                {
                    await SayOK("你的宠物必须达到15级或以上才能进化。");
                }
                else if (haveItem(5000029, 2) || haveItem(5000030, 2) || haveItem(5000031, 2) || haveItem(5000032, 2) || haveItem(5000033, 2))
                {
                    var selection = await AskMenu("你有一只还没有出来的龙，还有一只已经出来的龙。我可以帮你移除其中一只。请记住，我移除的龙的数据将会丢失。\r\n#r#L0#移除我的现金第一个槽位。#l#k\r\n#b#L1#移除我背包中的第一只龙。#l#k\r\n#g#L2#不用了，谢谢。#l#k");
                    if (selection == 0)
                    {
                        await SayOK("您的现金第一个槽位已被移除。");
                    }
                    else if (selection == 1)
                    {
                        if (haveItem(5000029, 2))
                        {
                            gainItem(5000029, -1);
                        }
                        else if (haveItem(5000030, 2))
                        {
                            gainItem(5000030, -1);
                        }
                        else if (haveItem(5000031, 2))
                        {
                            gainItem(5000031, -1);
                        }
                        else if (haveItem(5000032, 2))
                        {
                            gainItem(5000032, -1);
                        }
                        else if (haveItem(5000033, 2))
                        {
                            gainItem(5000033, -1);
                        }
                        await SayOK("你的库存中的第一只龙被移除。");
                    }
                }
                else
                {
                    var id = 5000029;
                    var petSlot = getPlayer().getPetIndexByItemId(id);
                    if (petSlot == -1)
                    {
                        await SayOK("你要么没有准备好进化的宠物龙，要么缺少#b#t5380000##k。");
                    }
                    else
                    {
                        var after = evolvePet(petSlot);
                        if (after != null)
                        {
                            gainItem(5380000, -1);
                            await SayOK($"你的龙现在进化了！它以前是一个 #i{id}# #t{id}#，现在它是一个 #i{after.getItemId()}# #t{after.getItemId()}#！");
                        }
                    }
                }
            }
            else
            {
                await SayOK("好的，下次见。");
            }
        }

        // Npc: 2040030
        public async Task ludi026()
        {
            var selection = await AskMenu("你好，我是金银岛的主要门徒#b玛尔仙子#k。玛尔仙子召唤我来这里，看看在卢德里布里姆这里宠物们是否得到了照顾。我能为你做些什么呢？\r\n#L0##b我的宠物变成了玩偶\r\n请帮我让它再次活动起来！#k#l \r\n#L1##b告诉我更多关于宠物的事情。#k#l \r\n#L2##b我如何养宠物？#k#l \r\n#L3##b宠物也会死吗？#k#l \r\n#L4##b棕色和黑色小猫的指令是什么？#k#l \r\n#L5##b棕色小狗的指令是什么？#k#l \r\n#L6##b粉色和白色小兔的指令是什么？#k#l \r\n#L7##b小型货物的指令是什么？#k#l \r\n#L8##b哈士奇的指令是什么？#k#l \r\n#L9##b黑猪的指令是什么？#k#l \r\n#L10##b熊猫的指令是什么？#k#l \r\n#L11##b恐龙男孩和女孩的指令是什么？#k#l \r\n#L12##b鲁道夫的指令是什么？#k#l \r\n#L13##b猴子的指令是什么？#k#l \r\n#L14##b机器人的指令是什么？#k#l \r\n#L15##b大象的指令是什么？#k#l \r\n#L16##b金猪的指令是什么？#k#l \r\n#L17##b企鹅的指令是什么？#k#l \r\n#L18##b小雪人的指令是什么？#k#l \r\n#L19##b少年巴尔洛格的指令是什么？#k#l \r\n#L20##b幼龙的指令是什么？#k#l \r\n#L21##b绿色/红色/蓝色龙的指令是什么？#k#l \r\n#L22##b黑龙的指令是什么？#k#l \r\n#L23##b雪人的指令是什么？#k#l \r\n#L24##b孙悟空的指令是什么？#k#l \r\n#L25##b少年死神的指令是什么？#k#l \r\n#L26##b水晶鲁道夫的指令是什么？#k#l \r\n#L27##b基诺的指令是什么？#k#l \r\n#L28##b白鸭的指令是什么？#k#l \r\n#L29##b粉豆人的指令是什么？#k#l \r\n#L30##b箭猪的指令是什么？#k#l");

            switch (selection)
            {
                case 0:
                    await SayNext("我是维斯普，继续进行我的主人玛尔仙女交给我的研究。在鲁迪布里姆甚至有很多宠物。我需要继续我的研究，所以请原谅我…");
                    break;
                case 1:
                    await SaySpeech([
                        "嗯，你一定有很多关于宠物的问题。很久以前，一个名叫#bCloy#k的人，给它喷洒了生命之水，并施加了魔法，创造了一种神奇的动物。我知道这听起来难以置信，但它是一个变成真实生物的玩偶。它们非常理解并且能很好地跟随人类。",
                        "但是生命之水只在世界树的最底部出现一点点，所以这些宝宝们不能永远活着... 我知道，这非常不幸... 但即使它再次变成玩偶，它们也可以被带回生命，所以在你和它在一起的时候要对它好。",
                        "哦，是的，当你给它们特殊指令时，它们会做出反应。你可以责备它们，爱护它们……这都取决于你如何照顾它们。它们害怕离开它们的主人，所以要对它们好，向它们展示爱。它们会很快感到伤心和孤独。"
                        ]);
                    break;
                case 2:
                    await SaySpeech([
                        "根据您给出的指令，宠物可能会喜欢、讨厌，并对其显示其他种类的反应。如果您给宠物一个指令，它能够很好地跟随您，您们之间的亲密度会提高。双击宠物，您可以检查亲密度、等级、饱食度等等...",
                        "与宠物交谈，关注它，它的亲密度将提高，最终它的整体等级也会提高。随着亲密度的提高，宠物的整体等级也会很快提高。随着整体等级的提高，有一天宠物甚至可能会稍微像人一样说话，所以努力提升它。当然，这并不容易……",
                        "它可能是一个活娃娃，但它们也有生命，所以它们也会感到饥饿。#b饱食度#k 显示宠物的饥饿程度。100 是最高值，数值越低，宠物就越饥饿。一段时间后，它甚至不会听从你的命令，而会主动进攻，所以要小心。",
                        "没错！宠物不能吃普通的人类食物。相反，玩具城的一个叫做#b#p2041014##k的泰迪熊出售#b宠物食物#k，所以如果你需要给你的宠物喂食，找到#b#p2041014##k会是个好主意。最好提前购买食物，并在宠物真的饿得很厉害之前喂食。",
                        "哦，如果你长时间不给宠物喂食，它会自己回家。你可以把它从家里带出来喂食，但这对宠物的健康不太好，所以尽量定期喂养它，这样它就不会降到那个程度了，好吗？我觉得这样就可以了。"
                        ]);
                    break;
                case 3:
                    await SaySpeech([
                        "垂死……嗯，严格来说它们并不算是活着的，所以我不确定\"垂死\"是否是正确的术语。它们是用我的魔法力量和生命之水变成活物的娃娃。当然，它们活着的时候就像活生生的动物一样……",
                        "一段时间后……没错，它们停止了移动。魔法效果消失，生命之水干涸后，它们就会变回木偶。但这并不意味着它们永远停止了，因为一旦你倒上生命之水，它们就会重新活过来。",
                        "即使它有一天再次移动，看到它们完全停止还是很伤心的。请在它们还活着并移动时对它们好一点。也要好好喂养它们。知道有一些活着的东西只跟随并听从你，是不是很好呢？"
                        ]);
                    break;
                case 4:
                    await SayNext("这些是#r棕色小猫和黑色小猫#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏猫, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 10 ~ 30)\r\n#b可爱#k (等级 10 ~ 30)\r\n#b站起来, 站, 起来#k (等级 20 ~ 30)");
                    break;
                case 5:
                    await SayNext("这些是#r棕色小狗#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏狗, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b笨蛋, 我讨厌你, 坏狗, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b撒尿#k (等级 10 ~ 30)\r\n#b说话, 说, 聊天, 叫#k (等级 10 ~ 30)\r\n#b趴下#k (等级 10 ~ 30)\r\n#b站起来, 站, 起来#k (等级 20 ~ 30)");
                    break;
                case 6:
                    await SayNext("这些是#r粉红兔子和白兔子#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b站起来, 站#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 10 ~ 30)\r\n#b拥抱#k (等级 10 ~ 30)\r\n#b睡觉, 困了, 上床#k (等级 20 ~ 30)");
                    break;
                case 7:
                    await SayNext("这些是#r迷你货物#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b站起来, 站立#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b撒尿#k (等级 1 ~ 30)\r\n#b说话, 聊天#k (等级 10 ~ 30)\r\n#b魅力, 魅力值#k (等级 10 ~ 30)\r\n#b乖孩子, 乖#k (等级 20 ~ 30)");
                    break;
                case 8:
                    await SayNext("这些是#rHusky#k的指令。指令旁边提到的等级是宠物需要的等级才能回应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bbad, no, badgirl, badboy#k (等级 1 ~ 30)\r\n#bstupid, ihateyou, baddog, dummy#k (等级 1 ~ 30)\r\n#biloveyou#k (等级 1 ~ 30)\r\n#bpee#k (等级 1 ~ 30)\r\n#btalk, say, chat, bark#k (等级 10 ~ 30)\r\n#bdown#k (等级 10 ~ 30)\r\n#bup, stand, rise#k (等级 20 ~ 30)");
                    break;
                case 9:
                    await SayNext("这些是#r黑猪#k的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏猪, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1~30)\r\n#b举手, 站起#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天, 拥抱#k (等级 10 ~ 30)\r\n#b微笑#k (等级 10 ~ 30)\r\n#b笑, 微笑#k (等级 10 ~ 30)\r\n#b魅力, 睡觉, 困了, 上床#k(等级 20~30)");
                    break;
                case 10:
                    await SayNext("这些是#r熊猫#k的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b站起来, 站立, 拥抱#k (等级 1 ~ 30)\r\n#b说话, 聊天#k (等级 10 ~ 30)\r\n#b玩耍#k (等级 20 ~ 30)\r\n#b嗯, 呃#k (等级 10 ~ 30)\r\n#b睡觉, 困了, 去睡觉#k (等级 20 ~ 30)");
                    break;
                case 11:
                    await SayNext("这些是 #r恐龙男孩和恐龙女孩#k 的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐#k (等级 1 ~ 30)\r\n#b坏, 不好, 愚蠢, 我讨厌你, 坏孩子, 坏女孩#k (等级 1 ~ 30)\r\n#b我爱你, 笨蛋#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b说话, 聊天 (等级 10 ~ 30)\r\n#b微笑, 大笑#k (等级 1 ~ 30)\r\n#b可爱#k (等级 10 ~ 30)\r\n#b睡觉, 小睡, 困了#k (等级 20 ~ 30)");
                    break;
                case 12:
                    await SayNext("这些是#r鲁道夫#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐下#k（等级1~30）\r\n#b坏，不行，坏女孩，坏男孩#k（等级1~30）\r\n#b站起来，站立#k（等级1~30）\r\n#b笨蛋，讨厌你，傻瓜#k（等级1~30）\r\n#b圣诞快乐，圣诞快乐#k（等级11~30）\r\n#b我爱你#k（等级1~30）\r\n#b便便#k（等级1~30）\r\n#b说话，说，聊天#k（等级11~30）\r\n#b孤独，独自，沮丧，红鼻子#k（等级11~30）\r\n#b可爱#k（等级11~30）\r\n#b走，去#k（等级21~30）");
                    break;
                case 13:
                    await SayNext("这些是#r猴子#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐, 休息#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏孩子, 坏女孩#k (等级 1 ~ 30)\r\n#b站起来, 站立#k(等级 1 ~ 30)\r\n#b我爱你, 小便#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 11 ~ 30)\r\n#b玩, 唱歌#k (等级 11 ~ 30)\r\n#b睡觉, 困了, 上床#k (等级 21 ~ 30)");
                    break;
                case 14:
                    await SayNext("这些是#r机器人#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐下, 站立, 起立#k (等级 1 ~ 30)\r\n#b攻击, 坏, 不, 坏孩子#k (等级 1 ~ 30)\r\n#b愚蠢, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你, 好#k (等级 1 ~ 30)\r\n#b说话, 伪装#k (等级 11 ~ 30)");
                    break;
                case 15:
                    await SayNext("这些是 #r大象#k 的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐, 休息#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏孩子, 坏女孩#k (等级 1 ~ 30)\r\n#b站起来, 站立, 起立#k (等级 1 ~ 30)\r\n#b我爱你, 小便#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天, 玩#k (等级 11 ~ 30)\r\n#b睡觉, 困了, 去睡觉#k (等级 21 ~ 30)");
                    break;
                case 16:
                    await SayNext("这些是#r金猪#k的指令。指令旁边提到的等级是宠物需要达到的等级才能响应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏蛋, 坏女孩#k (等级 1 ~ 30)\r\n#b拉屎, 我爱你#k (等级 1 ~ 30)\r\n#b说话, 说, 聊天#k (等级 11 ~ 30)\r\n#b爱我, 拥抱我#k (等级 11 ~ 30)\r\n#b睡觉, 困了, 上床#k (等级 21 ~ 30)\r\n#b印象深刻, 离开#k (等级 21 ~ 30)\r\n#b翻滚, 给我看钱#k (等级 21 ~ 30)");
                    break;
                case 17:
                    await SayNext("这些是 #r企鹅#k 的指令。指令旁边提到的等级是宠物需要的等级才能执行该指令。\r\n#b坐#k (等级 1 ~ 30)\r\n#b坏, 不行, 坏孩子, 坏女孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b站起来, 站, 起来#k (等级 1 ~ 30)\r\n#b我爱你#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b拥抱, 抱抱我#k (等级 10 ~ 30)\r\n#b挥动, 举手#k (等级 10 ~ 30)\r\n#b睡觉#k (等级 20 ~ 30)\r\n#b亲吻, 亲亲, 亲一个#k (等级 20 ~ 30)\r\n#b飞#k (等级 20 ~ 30)\r\n#b可爱, 可爱的#k (等级 20 ~ 30)");
                    break;
                case 18:
                    await SayNext("这些是 #r迷你雪人#k 的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b坏孩子, 不行, 坏男孩, 坏女孩#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b跳舞, 舞动, 摇摆#k (等级 1 ~ 30)\r\n#b可爱, 可爱宝贝, 漂亮, 可爱#k (等级 1 ~ 30)\r\n#b我爱你, 喜欢你, 我的爱#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说#k (等级 10 ~ 30)\r\n#b睡觉, 小睡#k (等级 10 ~ 30)");
                    break;
                case 19:
                    await SayNext("这些是#rJr.巴尔洛#k的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#bliedown#k (等级 1 ~ 30)\r\n#bno|bad|badgirl|badboy#k (等级 1 ~ 30)\r\n#biloveyou|mylove|likeyou#k (等级 1 ~ 30)\r\n#bcute|cutie|pretty|adorable#k (等级 1 ~ 30)\r\n#bpoop#k (等级 1 ~ 30)\r\n#bsmirk|crooked|laugh#k (等级 1 ~ 30)\r\n#bmelong#k (等级 11 ~ 30)\r\n#bgood|thelook|charisma#k (等级 11 ~ 30)\r\n#bspeak|talk|chat|say#k (等级 11 ~ 30)\r\n#bsleep|nap|sleepy#k (等级 11 ~ 30)\r\n#bgas#k (等级 21 ~ 30)");
                    break;
                case 20:
                    await SayNext("这些是#r宝宝龙#k的指令。指令旁边提到的等级显示了宠物需要响应的等级要求。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b不|坏|坏女孩|坏男孩#k (等级 1 ~ 30)\r\n#b我爱你|爱你#k (等级 1 ~ 30)\r\n#b拉屎#k (等级 1 ~ 30)\r\n#b笨蛋|讨厌你|傻瓜#k (等级 1 ~ 30)\r\n#b可爱#k (等级 11 ~ 30)\r\n#b说话|聊天|说#k (等级 11 ~ 30)\r\n#b睡觉|困|上床#k (等级 11 ~ 30)");
                    break;
                case 21:
                    await SayNext("这些是#r绿/红/蓝龙#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b坐#k (等级 15 ~ 30)\r\n#b不|坏|坏女孩|坏男孩#k (等级 15 ~ 30)\r\n#b我爱你|爱你#k (等级 15 ~ 30)\r\n#b便便#k (等级 15 ~ 30)\r\n#b笨蛋|讨厌你|傻瓜#k (等级 15 ~ 30)\r\n#b说话|聊天|说#k (等级 15 ~ 30)\r\n#b睡觉|困|上床#k (等级 15 ~ 30)\r\n#b变身#k (等级 21 ~ 30)");
                    break;
                case 22:
                    await SayNext("这些是#r黑龙#k的指令。指令旁边提到的等级是宠物需要的等级才能响应。\r\n#b坐下#k (等级 15 ~ 30)\r\n#b不行|坏|坏女孩|坏男孩#k (等级 15 ~ 30)\r\n#b我爱你|爱你#k (等级 15 ~ 30)\r\n#b拉屎#k (等级 15 ~ 30)\r\n#b笨蛋|讨厌你|傻瓜#k (等级 15 ~ 30)\r\n#b说话|聊天|说#k (等级 15 ~ 30)\r\n#b睡觉|困|上床#k (等级 15 ~ 30)\r\n#b可爱, 变化#k (等级 21 ~ 30)");
                    break;
                case 23:
                    await SayNext("这些是#r雪人#k的指令。指令旁边提到的等级显示了宠物需要的等级才能回应。\r\n#b傻瓜, 我讨厌你, 笨蛋#k (等级 1 ~ 30)\r\n#b我爱你, 我的爱, 我喜欢你#k (等级 1 ~ 30)\r\n#b圣诞快乐#k (等级 1 ~ 30)\r\n#b可爱, 可爱的, 可爱, 漂亮#k (等级 1 ~ 30)\r\n#b坏蛋, 不, 坏女孩, 坏男孩#k (等级 1 ~ 30)\r\n#b说话, 聊天, 说/睡觉, 困了, 去睡觉#k (等级 10 ~ 30)\r\n#b变身#k (等级 20 ~ 30)");
                    break;
                case 24:
                    await SayNext("这些是#r孙悟空#k的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#bsit#k(等级 1 ~ 30)\r\n#bno,bad,badgirl,badboy#k(等级 1 ~ 30)\r\n#bpoope#k(等级 1 ~ 30)\r\n#bcutie,adorable,cute,pretty#k(等级 1 ~ 30)\r\n#biloveyou,loveyou,luvyou,ilikeyou,mylove#k(等级 1 ~ 30)\r\n#btalk,chat,say/sleep,sleepy,gotobed#k(等级 10 ~ 30)\r\n#btransform#k(等级 20 ~ 30)");
                    break;
                case 25:
                    await SayNext("这些是#rJr. Reaper#k的指令。指令旁边提到的等级显示了宠物需要的等级才能执行该指令。\r\n#bsit#k (等级 1 ~ 30)\r\n#bno|bad|badgirl|badboy#k (等级 1 ~ 30)\r\n#bplaydead, poop#k (等级 1 ~ 30)\r\n#btalk|chat|say#k (等级 1 ~ 30)\r\n#biloveyou, hug#k (等级 1 ~ 30)\r\n#bsmellmyfeet, rockout, boo#k (等级 1 ~ 30)\r\n#btrickortreat#k (等级 1 ~ 30)\r\n#bmonstermash#k (等级 1 ~ 30)");
                    break;
                case 26:
                    await SayNext("这些是#r水晶鲁道夫#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#b坐下#k (等级 1 ~ 30)\r\n#b不行|坏女孩|坏男孩#k (等级 1 ~ 30)\r\n#b呸|笑话#k(等级 1~30)\r\n#b变装|变身#k(等级 1 ~ 30) \r\n#b棒极了|感觉良好|啦啦啦#k(等级 1 ~ 30) \r\n#b爱你|嘿宝贝#k(等级 1 ~ 30) \r\n#b说话|说|聊天#k(等级 10 ~ 30) \r\n#b睡觉|困了|小睡|上床#k(等级 20 ~ 30)");
                    break;
                case 27:
                    await SayNext("这些是#rKino#k的指令。指令旁边提到的等级显示了宠物需要的等级才能响应。\r\n#bsit#k (等级 1 ~ 30)\r\n#bbad|no|badgirl|badboy#k (等级 1 ~ 30)\r\n#bpoop#k (等级 1 ~ 30)\r\n#bsleep|nap|sleepy|gotobed#k(等级 1 ~ 30) \r\n#btalk|say|chat#k(等级 10 ~ 30) \r\n#biloveyou|mylove|likeyou#k(等级 10 ~ 30) \r\n#bmeh|bleh#k(等级 10 ~ 30) \r\n#bdisguise|change|transform#k(等级 20 ~ 30)");
                    break;
                case 28:
                    await SayNext("这些是#r白鸭#k的指令。指令旁边提到的等级显示了宠物需要的等级才能执行该指令。\r\n#b坐下#k（等级1~30）\r\n#b坏|不行|坏女孩|坏男孩#k（等级1~30）\r\n#b站起来|站立#k（等级1~30）\r\n#b拉屎#k（等级1~30）\r\n#b说话|聊天|说#k（等级1~30）\r\n#b拥抱#k（等级1~30）\r\n#b爱你#k（等级1~30）\r\n#b可爱#k（等级1~30）\r\n#b睡觉#k（等级1~30）\r\n#b聪明（等级10~30）\r\n#b跳舞#k（等级20~30）\r\n#b天鹅#k（等级20~30）");
                    break;
                case 29:
                    await SayNext("这些是#r粉豆#k的指令。指令旁边提到的等级是宠物需要达到的等级才能执行该指令。\r\n#b坐下#k（等级1~30）\r\n#b坏|不行|坏女孩|坏男孩|便便#k（等级1~30）\r\n#b懒惰|傻瓜|我讨厌你说话|聊天|说|嘟囔我爱你|拥抱我|爱你#k（等级1~30）\r\n#b摇晃|音乐|魅力呃|笑话|嘘#k（等级20~30）\r\n#b去睡觉|睡觉|困了戳|臭|傻瓜|我讨厌你#k（等级20~30）\r\n#b砰砰#k（等级30）");
                    break;
                case 30:
                    await SayNext("这些是 #rPorcupine#k 的指令。指令旁边提到的等级显示了宠物需要的等级才能执行该指令。\r\n#bsit#k (等级 1 ~ 30)\r\n#bno|bad|badgirl|badboy#k (等级 1 ~ 30)\r\n#bhugcushion|sleep|knit|poop#k (等级 1 ~ 30)\r\n#bcomb|beach#k (等级 10 ~ 30)\r\n#btreeninja|dart#k (等级 20 ~ 30)");
                    break;
            }
        }
        // Npc: 2040032
        public async Task ludi028()
        {
            if (await AskYesNo("这是你可以带宠物散步的道路。你可以和它一起四处走动，或者在这里训练它通过障碍物。如果你和宠物还不够亲近，可能会出现问题，它就不会像你命令的那样跟着你走了……那么，你觉得呢？想要训练你的宠物吗？"))
            {
                if (haveItem(4031128))
                {
                    await SayNext("拿到那封信，和你的宠物一起跳过障碍物，把那封信带给我的兄弟#p1012007#。把信交给他，你的宠物会有好事发生。");
                }
                else
                {
                    gainItem(4031128, 1);
                    await SayOK("好的，这是信。如果你直接去那里，他不会知道我派你去的，所以带着你的宠物通过障碍，到达顶部，然后和#p1012007#交谈，把信交给他。如果你在通过障碍时注意你的宠物，这并不难。祝你好运！");
                }
            }
            else
            {
                await SayNext("嗯...现在太忙了？如果你想做的话，回来找我吧。");
            }
        }
        // Npc: 2040033
        public async Task ludi029()
        {
            if (haveItem(4031128))
            {
                await SayNext("嗯，那是我哥的信！可能是在责备我觉得自己没在工作之类的事情...嗯？啊...你听从我哥的建议，训练了你的宠物并且到了这里，是吧？太棒了！既然你为了到这里努力了，我会提高你和宠物的亲密度等级。");
                
                if (getPlayer().getNoPets() == 0)
                {
                    await SayNext("嗯... 你真的带着你的宠物来到这里吗？这些障碍是为宠物准备的。你没有宠物来这里干什么？滚出去！");
                }
                else
                {
                    gainItem(4031128, -1);
                    gainTameness(4);
                    await SayOK("你觉得呢？你不觉得你和你的宠物已经更亲近了吗？如果你有时间，再次训练你的宠物通过这个障碍课程……当然，要得到我哥哥的许可。");
                }
            }
            else
            {
                await SayOK("我哥叫我照顾宠物障碍赛道，但是……因为我离他太远了，我忍不住想要四处闲逛……嘿嘿，既然看不见他，那就随便放松几分钟吧。");
            }
        }


        // Npc: 9102100
        public async Task multipet_success()
        {
            if (getQuestStatus(4646) == 1)
            {
                if (haveItem(4031921))
                {
                    await SayNext("这是什么……呸……里面有宠物的粪便！");
                }
                else if (await AskYesNo("#b(我看到有东西被草覆盖着。我应该把它拔出来吗？)"))
                {
                    await SayNext("我找到了宠物训练师巴托斯藏起来的物品……还有这张便条。");
                    gainItem(4031921, 1);
                }
                else
                {
                    await SayNext("#b(我没有触碰这个被草覆盖的隐藏物品)");
                }
            }
            else
            {
                await SayOK("#b(我什么都找不到。)");
            }
        }


        // Npc: 9102101
        public async Task multipet_fail()
        {
            if (await AskYesNo("#b(我看到有东西被草覆盖着。我应该把它拔出来吗？)"))
            {
                await SayNext("#b(呸... 这是宠物的粪便！)");
                gainItem(4031922, 1);
            }
            else
            {
                await SayNext("#b(我没太在意，所以我没碰它。)");
            }
        }
    }
}
